Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/edc/ATSAMD20E15BU.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x40000826"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="DFLLVAL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40000828">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="FINE" edc:nzwidth="0xA" edc:desc="Fine Calibration Value"/>
            <edc:SFRFieldDef edc:cname="COARSE" edc:nzwidth="0x6" edc:desc="Coarse Calibration Value"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:nzwidth="0x10" edc:desc="Multiplication Ratio Difference"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="DFLLMUL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4000082C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="MUL" edc:nzwidth="0x10" edc:desc="Multiplication Value"/>
            <edc:SFRFieldDef edc:cname="FSTEP" edc:nzwidth="0xA" edc:desc="Maximum Fine Step Size"/>
            <edc:SFRFieldDef edc:cname="CSTEP" edc:nzwidth="0x6" edc:desc="Maximum Coarse Step Size"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="DFLLSYNC" edc:nzwidth="0x8" edc:access="n-------" edc:por="00000000" edc:mclr="00000000" edc:impl="0x80" edc:_addr="0x40000830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="READREQ" edc:nzwidth="0x1" edc:desc="Read Request Synchronization"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000831"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="BOD33" edc:nzwidth="0x20" edc:access="----------nnnnnnnnnn--nn-n-nnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF35E" edc:_addr="0x40000834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action when Threshold Crossed">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BODVDD generates a reset" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BODVDD generates an interrupt" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1" edc:desc="Operation Modes"/>
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Clock Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PSEL" edc:nzwidth="0x4" edc:desc="Prescaler Select">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:nzwidth="0x6" edc:desc="Threshold Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40000838"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="VREG" edc:nzwidth="0x10" edc:access="--n------n------" edc:por="0000010000000010" edc:mclr="0000010000000010" edc:impl="0x2040" edc:_addr="0x4000083C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="FORCELDO" edc:nzwidth="0x1" edc:desc="Force LDO Voltage Regulator"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4000083E"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="VREF" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnn-------------nn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FF0006" edc:_addr="0x40000840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEN" edc:nzwidth="0x1" edc:desc="Temperature Sensor Output Enable"/>
            <edc:SFRFieldDef edc:cname="BGOUTEN" edc:nzwidth="0x1" edc:desc="Bandgap Output Enable"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:nzwidth="0xB" edc:desc="Voltage Reference Calibration Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
